[
  {
    "name": "Thomson Reuters",
    "position": "Associate Software Engineer",
    "location": "Bangalore, KA, India",
    "fromMonth": "August",
    "fromYear": "2013",
    "toMonth": "April",
    "toYear": "2015",
    "link": "https://www.thomsonreuters.com/",
    "description": [
      {
        "desc": "Developed RESTful web services for production environments using Java/J2EE, Spring and Hibernate extensively."
      },
      {
        "desc": "Involved in agile SDLC development methodology by engineering solutions through continuous integration and development model."
      },
      {
        "desc": "Contributed to quality assurance by writing test cases for cross platform application engineering and testing in a dynamic and test-driven development (TDD) environment."
      },
      {
        "desc": "Actively involved in gathering technical requirements and designing them using Object Oriented Programming (OOP) approach."
      },
      {
        "desc": "Participated in software engineering of high quality solutions by adhering to proper design patterns and good programming skills."
      },
      {
        "desc": "Appreciated for passionate, strategic thinking and positive impact on team management through delivery of high performance and low latency data analytics tool."
      }
    ],
    "responsibilities": [
      {
        "name": "Metrics",
        "description": "Architected a data analysis and visualization tool as an effective team management solution and acting as a liaison for gathering the requirements. Participated as Lead and Primary Java developer for the project."
        "techUsed": "Java,JDBC,JPA,SQL,JFreeChart,TFS SDK,Play,Hibernate ORM"
      },
      {
        "name": "Index Management",
        "description": "Contributed as a Java developer and tester using Spring and Hibernate to create an online index tool (REST webservice) for the legal division of Thomson Reuters",
        "techUsed": "Java,JDBC,JPA,SQL,Spring,Hibernate ORM,Mockito"
      }
    ],
    "achievements": [
      {
        "desc": "Awarded for the involvement in technical innovation by addressing a tech talk on AMQP protocol."
      }
    ]
  },
  {
    "name": "Temminova",
    "position": "Intern",
    "location": "Bangalore, KA, India",
    "fromMonth": "November",
    "fromYear": "2013",
    "toMonth": "June",
    "toYear": "2013",
    "link": "https://teminnova.com/index.html",
    "description": [
      {
        "desc": "Developed mobile applications using Android SDK."
      },
      {
        "desc": "Actively involved in creation of an application called Track the Trails."
      },
      {
        "desc": "Contributed to modules of the applicaiton that used GPS and Camera sensors for geo-tagging the images."
      },
      {
        "desc": "Developed mobile applications using Android SDK."
      }
    ],
    "responsibilities": [
      {}
    ],
    "achievements": [
      {}
    ]
  }
]
